#### Imports

In [1]:
import pandas as pd
import sqlite3 as sq

#### Import from Old SQLite Store

In [94]:
book = pd.read_sql_query(f"SELECT * from Book", sq.connect("oldstore.db"))
book.head()

,id,pub_id,title,price,category,quantity,b_format,prod_year,filesize
0,0399149392,21,Chesapeake Blue,25.95,Literature & Fiction,41,epub,2002,7676
1,156158648X,61,The New City Home: Smart Solutions for Metro L...,24.95,Home Design,30,leaflet,2003,1042
2,0156006219,10,The Magician's Assistant,13.00,Romance,33,epub,1998,5220
3,0440237556,41,The Dark Highlander,6.99,Romance,69,pdf,2002,55
4,038572179X,54,Atonement,14.00,Literature & Fiction,77,leaflet,2003,5817

#### Drop Columns to Match our new SQLite DB Columns

In [6]:
book.columns

Index(['id', 'pub_id', 'title', 'price', 'category', 'quantity', 'b_format',
       'prod_year', 'filesize'],
      dtype='object')

In [92]:
book = book.drop(columns=['pub_id', 'filesize'])

#### Book Table
Clean ID Table

In [ ]:
book['id'] = book['id'].str.strip('X')
book['id'] = book['id'].str.replace(('-'),"")

In [ ]:
book.rename(columns={'prod_year': 'year', 'category': 'category_id'}, inplace=True)
book['rating'] = 100
book = book[['id', 'title', 'price', 'year', 'quantity', 'rating', 'category_id']]

In [99]:
book.head()

,id,title,price,year,quantity,rating,category_id
0,0399149392,Chesapeake Blue,25.95,2002,41,100,Literature & Fiction
1,156158648X,The New City Home: Smart Solutions for Metro L...,24.95,2003,30,100,Home Design
2,0156006219,The Magician's Assistant,13.00,1998,33,100,Romance
3,0440237556,The Dark Highlander,6.99,2002,69,100,Romance
4,038572179X,Atonement,14.00,2003,77,100,Literature & Fiction

#### Author Table

In [60]:
author = pd.read_sql_query(f"SELECT * from Source", sq.connect("oldstore.db"))

In [63]:
# Cast Table Column to String
author['s_name'] = author['s_name'].astype('string')

# Rename Columns
author.rename(columns={'s_name': 'name'}, inplace=True)

#### Book Author Table

In [4]:
bookauthor = pd.read_sql_query(f"SELECT * from SourceProduct", sq.connect("oldstore.db"))
bookauthor.rename(columns={'s_id': 'author_id', 'prod_id': 'book_id'})

       id  s_id        prod_id
0       1    25     0743467523
1       2    96     0440237556
2       3    31     0385494246
3       4    54     156158648X
4       5    22     0061020656
..    ...   ...            ...
136   137    71     0517576600
137   138    34     1579550088
138   139    97     0316666343
139   140    92     0972263608
140  1000  1000  0-7475-3269-9

[141 rows x 3 columns]

#### Category Table

In [58]:
category = pd.DataFrame({'category': book["category"].unique()})
category.index = category.index + 1
category['id'] = category.index

# Fix Category Column Types
category['category'] = category['category'].astype('string')

# Reorder, Rename, and Reset Index 
category = category[['id', 'category']]
category.rename(columns={'category': 'name'},inplace=True)
category.reset_index(inplace=True, drop=True)

In [59]:
category

   id                  name
0   1  Literature & Fiction
1   2           Home Design
2   3               Romance
3   4               Science
4   5               Fantasy
5   6              Computer
6   7  Accounting & Finance
7   8                Horror
8   9             Reference
9  10               Fiction